In [1]:
import pandas as pd

In [10]:
train = pd.read_csv('./dataset/observations_train.csv')

In [11]:
train.head()

  series_id                         date  value
0    AAA10Y  2000-01-03 00:00:00.0000000   1.17
1    AAA10Y  2000-01-04 00:00:00.0000000   1.20
2    AAA10Y  2000-01-05 00:00:00.0000000   1.16
3    AAA10Y  2000-01-06 00:00:00.0000000   1.15
4    AAA10Y  2000-01-07 00:00:00.0000000   1.17

In [12]:
test = pd.read_csv('./dataset/observations_test.csv')

In [13]:
test.head()

  series_id                         date  value
0    AAA10Y  2018-01-02 00:00:00.0000000   1.06
1    AAA10Y  2018-01-03 00:00:00.0000000   1.06
2    AAA10Y  2018-01-04 00:00:00.0000000   1.01
3    AAA10Y  2018-01-05 00:00:00.0000000   1.03
4    AAA10Y  2018-01-08 00:00:00.0000000   1.01

In [14]:
test[test['series_id']=='SP500'].count()

series_id    813
date         813
value        784
dtype: int64

In [19]:
train[train['series_id']=='SP500'].head()

      series_id                         date    value
84020     SP500  2011-02-14 00:00:00.0000000  1332.32
84021     SP500  2011-02-15 00:00:00.0000000  1328.01
84022     SP500  2011-02-16 00:00:00.0000000  1336.32
84023     SP500  2011-02-17 00:00:00.0000000  1340.43
84024     SP500  2011-02-18 00:00:00.0000000  1343.01

In [16]:
train[train['series_id']=='SP500'].tail()

      series_id                         date    value
85810     SP500  2017-12-25 00:00:00.0000000      NaN
85811     SP500  2017-12-26 00:00:00.0000000  2680.50
85812     SP500  2017-12-27 00:00:00.0000000  2682.62
85813     SP500  2017-12-28 00:00:00.0000000  2687.54
85814     SP500  2017-12-29 00:00:00.0000000  2673.61

In [18]:
test[test['series_id']=='SP500'].count()

series_id    813
date         813
value        784
dtype: int64

In [12]:
train[train['series_id']=='AAA10Y'].head()

  series_id              date  value
0    AAA10Y  01-03-2000 00:00   1.17
1    AAA10Y  01-04-2000 00:00   1.20
2    AAA10Y  01-05-2000 00:00   1.16
3    AAA10Y  01-06-2000 00:00   1.15
4    AAA10Y  01-07-2000 00:00   1.17